export interface Q {
    q: string;
    a: string[];
    rightAnswerIndex: number; //Начинается с 0
}

export const questions: Q[] = [{
    q: "Кто автор романа «Всадник без головы»?",
    a: ["Томас Майн Рид", "Харпер Ли", "Виктор Гюго", "Эрих Мария Ремарк"],
    rightAnswerIndex: 0
},
{
    q: "Название «Острова сокровищ» у Льюиса Стивенсона?",
    a: ["Мадагаскар", "Сахалин", "Камчатка", "Остров Пинос"],
    rightAnswerIndex: 3
},
{
    q: "Кем по образованию был писатель, создавший образ Шерлока Холмса?",
    a: ["Учитель", "Геолог", "Врач", "Автомеханик"],
    rightAnswerIndex: 2
},
{
    q: "Как звали ключаря собора Нотр-Дам в романе Виктора Гюго?",
    a: ["Эсмеральда", "Клод Фролло", "Пьер Гренгуар", "Квазимодо"],
    rightAnswerIndex: 3
},
{
    q: "После выхода в свет какого романа Жюля Верна французское Географическое общество выступило с инициативой принять единую систему измерения времени?",
    a: ["Вокруг Луны", "Вокруг света за восемьдесят дней", "Плавучий остров", "Пятнадцатилетний капитан"],
    rightAnswerIndex: 1
},
{
    q: "При каком царе в России началось книгопечатание?",
    a: ["Иван IV", "Иван III", "Иван II", "Пётр I"],
    rightAnswerIndex: 0
},
{
    q: "Как звали русского писателя, который написал пьесу «Чайка»?",
    a: ["Тургенев И.С.", "Островский А.Н.", "Бунин И.А.", "Чехов А.П."],
    rightAnswerIndex: 3
},
{
    q: "Назовите историческую поэму Сергея Александровича Есенина?",
    a: ["Зайцев", "Куклачёв", "Пугачев", "Антонов"],
    rightAnswerIndex: 2
},
{
    q: "Что Блок подразумевал под «электрическим сном наяву»?",
    a: ["Электрическую лампочку", "Театр", "Видеоигры", "Кинематограф"],
    rightAnswerIndex: 3
},
{
    q: "Сюжет какого романа Александр Дюма нашел в «Записках из архива парижской полиции»?",
    a: ["Три мушкетёра", "Граф Монте-Кристо", "Королева Марго", "Чёрный тюльпан"],
    rightAnswerIndex: 1
}
    ,
{
    q: "Какой английский писатель считается родоначальником периодической печати?",
    a: ["Даниэль Дефо", "Чарльз Диккенс", "Уильям Шекспир", "Оскар Уайльд"],
    rightAnswerIndex: 0
},
{
    q: "Кем был по профессии Антуан де Сент-Экзюпери?",
    a: ["Военный лётчик", "Шахтёр", "Хоккеист", "Капитан корабля"],
    rightAnswerIndex: 0
}
    ,
{
    q: "Фантаст, автор романов «Магелланово облако», «Солярис», «Эдем»?",
    a: ["Рэй Брэдбери", "Станислав Лем", "Гарри Гаррисон", "Кир Булычев"],
    rightAnswerIndex: 1
},
{
    q: "Три карты, обладающие магическим действием в «Пиковой даме»?",
    a: ["Туз, туз, туз", "Двойка, семерка, туз", "Дама, корол, туз", "Тройка, семерка, туз"],
    rightAnswerIndex: 3
}
    ,
{
    q: "Кто из английских писателей создал образ «Питера Пэна»?",
    a: ["Джоан Роулинг", "Джордж Оруэлл", "Джеймс Мэтью Барри", "Редьярд Киплинг"],
    rightAnswerIndex: 2
}]